python/10.time-and-datetime.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>时间和日期相关处理函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">时间和日期相关处理函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4eeff3">1. 基本操作</a></li>
<li><a href="#orgc43b8a4">2. time 模块</a>
<ul>
<li><a href="#orge29eec9">2.1. 时间戳和 <code>struct_time</code> 转换</a></li>
<li><a href="#org247b1cc">2.2. 格式化处理时间, 字符串和 <code>struct_time</code> 之间转换</a></li>
<li><a href="#org00d2737">2.3. 时间戳和字符串之间转换</a></li>
<li><a href="#orgd4f79d1">2.4. 线程休眠</a></li>
<li><a href="#org21869de">2.5. 格式化时间表格</a></li>
</ul>
</li>
<li><a href="#org524b900">3. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc4eeff3" class="outline-2">
<h2 id="orgc4eeff3"><span class="section-number-2">1</span> 基本操作</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>time</code> 模块提供和时间相关的处理函数。 <code>datetime</code> 提供和日期相关的处理函数
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> time
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.time<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#33719;&#21462;&#24403;&#21069;&#26102;&#38388;</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #6c71c4;">int</span><span style="color: #d8241f;">(</span>time.time<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>

<span style="color: #859900;">from</span> datetime <span style="color: #859900;">import</span> datetime, timedelta
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>datetime.today<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">year</span> = timedelta<span style="color: #8d5649;">(</span>days=365<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>year.total_seconds<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>year<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>datetime.today<span style="color: #d8241f;">()</span> + year<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
1540362889.897552
1540362889
2018-10-24 14:34:49.897552
31536000.0
365 days, 0:00:00
2019-10-24 14:34:49.897552

</pre>
</div>
</div>


<div id="outline-container-orgc43b8a4" class="outline-2">
<h2 id="orgc43b8a4"><span class="section-number-2">2</span> time 模块</h2>
<div class="outline-text-2" id="text-2">
<p>
time 模块中的所有时间通过 <code>time.struct_time</code> 数据结构存储。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">lt</span> = time.localtime<span style="color: #8d5649;">()</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">local time</span>
<span style="color: #6c71c4;">gt</span> = time.gmtime<span style="color: #8d5649;">()</span>    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">UTC time</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>lt<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>gt<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
time.struct_time(tm_year=2018, tm_mon=10, tm_mday=24, tm_hour=14, tm_min=47, tm_sec=1, tm_wday=2, tm_yday=297, tm_isdst=0)
time.struct_time(tm_year=2018, tm_mon=10, tm_mday=24, tm_hour=6, tm_min=47, tm_sec=1, tm_wday=2, tm_yday=297, tm_isdst=0)

</pre>
</div>

<div id="outline-container-orge29eec9" class="outline-3">
<h3 id="orge29eec9"><span class="section-number-3">2.1</span> 时间戳和 <code>struct_time</code> 转换</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">t</span> = time.time<span style="color: #8d5649;">()</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.localtime<span style="color: #d8241f;">(</span>t<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">timestamp -&gt; struct_time</span>
<span style="color: #6c71c4;">lt</span> = time.localtime<span style="color: #8d5649;">()</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.mktime<span style="color: #d8241f;">(</span>lt<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>   <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">the inverse function of localtime(), struct_time -&gt; timestamp</span>
</pre>
</div>

<pre class="example">
time.struct_time(tm_year=2018, tm_mon=10, tm_mday=24, tm_hour=14, tm_min=47, tm_sec=55, tm_wday=2, tm_yday=297, tm_isdst=0)
1540363675.0

</pre>
</div>
</div>

<div id="outline-container-org247b1cc" class="outline-3">
<h3 id="org247b1cc"><span class="section-number-3">2.2</span> 格式化处理时间, 字符串和 <code>struct_time</code> 之间转换</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">fmt</span> = <span style="color: #2aa198;">'%Y-%m-%d %H:%M:%S'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strftime<span style="color: #d8241f;">(</span>fmt, time.localtime<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strftime<span style="color: #d8241f;">(</span>fmt, time.gmtime<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strptime<span style="color: #d8241f;">(</span><span style="color: #2aa198;">'2018-10-24 14:51:03'</span>, fmt<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
2018-10-24 14:52:05
2018-10-24 06:52:05
time.struct_time(tm_year=2018, tm_mon=10, tm_mday=24, tm_hour=14, tm_min=51, tm_sec=3, tm_wday=2, tm_yday=297, tm_isdst=-1)

</pre>
</div>
</div>

<div id="outline-container-org00d2737" class="outline-3">
<h3 id="org00d2737"><span class="section-number-3">2.3</span> 时间戳和字符串之间转换</h3>
<div class="outline-text-3" id="text-2-3">
<p>
需要借助 Python 的 time 模块中的 <code>struct_time</code> 作为中间数据结构来进行转换
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">fmt</span> = <span style="color: #2aa198;">'%Y-%m-%d %H:%M:%S'</span>
<span style="color: #6c71c4;">ts</span> = time.time<span style="color: #8d5649;">()</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strftime<span style="color: #d8241f;">(</span>fmt, time.localtime<span style="color: #9564bf;">(</span>ts<span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.mktime<span style="color: #d8241f;">(</span>time.strptime<span style="color: #9564bf;">(</span><span style="color: #2aa198;">'2018-10-24 15:03:46'</span>, fmt<span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
2018-10-24 15:05:49
1540364626.0

</pre>
</div>
</div>

<div id="outline-container-orgd4f79d1" class="outline-3">
<h3 id="orgd4f79d1"><span class="section-number-3">2.4</span> 线程休眠</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>sleep</code> 可以是线程休眠相应的秒数。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">fmt</span> = <span style="color: #2aa198;">'%Y-%m-%d %H:%M:%S'</span>
<span style="color: #6c71c4;">sec</span> = 3
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strftime<span style="color: #d8241f;">(</span>fmt, time.localtime<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
time.sleep<span style="color: #8d5649;">(</span>sec<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>time.strftime<span style="color: #d8241f;">(</span>fmt, time.localtime<span style="color: #9564bf;">()</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
2018-10-24 14:56:01
2018-10-24 14:56:04

</pre>
</div>
</div>

<div id="outline-container-org21869de" class="outline-3">
<h3 id="org21869de"><span class="section-number-3">2.5</span> 格式化时间表格</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Directive</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%a</td>
<td class="org-left">Locale’s abbreviated weekday name.</td>
</tr>

<tr>
<td class="org-left">%A</td>
<td class="org-left">Locale’s full weekday name.</td>
</tr>

<tr>
<td class="org-left">%b</td>
<td class="org-left">Locale’s abbreviated month name.</td>
</tr>

<tr>
<td class="org-left">%B</td>
<td class="org-left">Locale’s full month name.</td>
</tr>

<tr>
<td class="org-left">%c</td>
<td class="org-left">Locale’s appropriate date and time representation.</td>
</tr>

<tr>
<td class="org-left">%d</td>
<td class="org-left">Day of the month as a decimal number [01,31].</td>
</tr>

<tr>
<td class="org-left">%H</td>
<td class="org-left">Hour (24-hour clock) as a decimal number [00,23].</td>
</tr>

<tr>
<td class="org-left">%I</td>
<td class="org-left">Hour (12-hour clock) as a decimal number [01,12].</td>
</tr>

<tr>
<td class="org-left">%j</td>
<td class="org-left">Day of the year as a decimal number [001,366].</td>
</tr>

<tr>
<td class="org-left">%m</td>
<td class="org-left">Month as a decimal number [01,12].</td>
</tr>

<tr>
<td class="org-left">%M</td>
<td class="org-left">Minute as a decimal number [00,59].</td>
</tr>

<tr>
<td class="org-left">%p</td>
<td class="org-left">Locale’s equivalent of either AM or PM.</td>
</tr>

<tr>
<td class="org-left">%S</td>
<td class="org-left">Second as a decimal number [00,61].</td>
</tr>

<tr>
<td class="org-left">%U</td>
<td class="org-left">Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.</td>
</tr>

<tr>
<td class="org-left">%w</td>
<td class="org-left">Weekday as a decimal number [0(Sunday),6].</td>
</tr>

<tr>
<td class="org-left">%W</td>
<td class="org-left">Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.</td>
</tr>

<tr>
<td class="org-left">%x</td>
<td class="org-left">Locale’s appropriate date representation.</td>
</tr>

<tr>
<td class="org-left">%X</td>
<td class="org-left">Locale’s appropriate time representation.</td>
</tr>

<tr>
<td class="org-left">%y</td>
<td class="org-left">Year without century as a decimal number [00,99].</td>
</tr>

<tr>
<td class="org-left">%Y</td>
<td class="org-left">Year with century as a decimal number.</td>
</tr>

<tr>
<td class="org-left">%z</td>
<td class="org-left">Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59].</td>
</tr>

<tr>
<td class="org-left">%Z</td>
<td class="org-left">Time zone name (no characters if no time zone exists).</td>
</tr>

<tr>
<td class="org-left">%%</td>
<td class="org-left">A literal '%' character.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org524b900" class="outline-2">
<h2 id="org524b900"><span class="section-number-2">3</span> 参考链接</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://docs.python.org/3/library/time.html#module-time">module-time</a></li>
<li><a href="https://docs.python.org/3/library/datetime.html#module-datetime">module-datetime</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-24 Wed 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:46</p>
</div>
</body>
</html>
